Tekla Open API Reference for Tekla Structures 2025
InsidePartAlongPartPlacingType Class
 The InsidePartAlongPartPlacingType class defines a placing type that places the object using the base line placing. The base line used is in the middle of the part, aligned with the part.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.PreferredPlacingTypeBase
 Tekla.Structures.Drawing.InsidePartAlongPartPlacingType
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public class InsidePartAlongPartPlacingType : PreferredPlacingTypeBase
<SerializableAttribute>
Public Class InsidePartAlongPartPlacingType
	Inherits PreferredPlacingTypeBase
The InsidePartAlongPartPlacingType type exposes the following members.
Constructors
Name | Description
InsidePartAlongPartPlacingType
 Creates a new inside part along part placing type instance.
Top
See Also
Reference
Tekla.Structures.Drawing Namespace